{
  "world_instance_uuid": "05e07dad-f24b-420b-822c-1ae7862220f6",
  "world_details": {
    "description": "Default",
    "rules": {}
  },
  "location_details": {},
  "objects": {},
  "active_simulacra_ids": [
    "sim_662862",
    "sim_3e912d"
  ],
  "world_time": 363.2766499998908,
  "narrative_log": [
    "[T17.5] Alex pauses, considering the situation.",
    "[T20.1] Alex pauses, considering the situation.",
    "[T19.9] Eleanor Vance's action failed: Action failed due to internal error (JSON decode).",
    "[T22.9] Alex pauses, considering the situation.",
    "[T22.6] Eleanor Vance's action failed: Action failed due to internal error (JSON decode).",
    "[T25.6] Alex pauses, considering the situation.",
    "[T26.6] Alex pauses, considering the situation.",
    "[T28.1] Alex pauses, considering the situation.",
    "[T29.2] Alex pauses, considering the situation.",
    "[T30.6] Alex pauses, considering the situation.",
    "[T32.9] Alex pauses, considering the situation.",
    "[T32.4] Eleanor Hayes's action failed: Action failed due to internal error (JSON decode).",
    "[T35.9] Alex pauses, considering the situation.",
    "[T35.5] Eleanor Hayes's action failed: Action failed due to internal error (JSON decode).",
    "[T38.2] Alex pauses, considering the situation.",
    "[T39.5] Alex pauses, considering the situation.",
    "[T41.3] Alex pauses, considering the situation.",
    "[T41.0] Eleanor Vance's action failed: Action failed due to internal error (JSON decode).",
    "[T44.1] Alex pauses, considering the situation.",
    "[T45.0] Alex pauses, considering the situation.",
    "[T46.6] Alex pauses, considering the situation.",
    "[T48.7] Alex pauses, considering the situation.",
    "[T50.2] Alex pauses, considering the situation.",
    "[T51.8] Alex pauses, considering the situation.",
    "[T51.5] Eleanor Vance's action failed: Action failed due to internal error (JSON decode).",
    "[T56.6] The Foyer is dimly lit, with shadows clinging to the corners. A grand, curving staircase dominates the space, leading to an unseen upper level. Dust motes dance in the faint light filtering through a grimy window. An Exit Door is set into the far wall.",
    "[T61.1] Eleanor tries the lock on the Exit Door, but doesn't have the right key.",
    "[T65.1] The Foyer is dimly lit, with shadows clinging to the corners. A grand, curving staircase dominates the space, leading to an unseen upper level. Dust motes dance in the faint light filtering through a grimy window. An Exit Door is set into the far wall.",
    "[T66.7] Eleanor Vance's action failed: Eleanor tries to use the upper level, but it's not here.",
    "[T69.1] Eleanor Vance's action failed: Eleanor tries to use the staircase, but nothing happens / that doesn't seem possible.",
    "[T73.6] Eleanor Hayes's action failed: Action failed due to internal error (JSON decode).",
    "[T75.4] The room is sparsely furnished. A metal desk sits against one wall, and a locked metal door is on the opposite side. There is a barred window overlooking a grey, featureless landscape. A small, empty bookshelf stands near the door.",
    "[T86.2] Alex searches the desk thoroughly but finds nothing useful or out of the ordinary.",
    "[T87.3] Alex searches the bookshelf and finds a small brass key!",
    "[T89.3] Eleanor Vance's action failed: Action failed due to internal error (JSON decode).",
    "[T91.5] Alex tries the lock on the door, but doesn't have the right key.",
    "[T98.0] The Main Library is a grand, high-ceilinged room filled with towering bookshelves. Sunlight streams in through large arched windows, illuminating dust motes dancing in the air. The scent of old paper and leather permeates the space. Several tables and chairs are scattered throughout, and a large oak desk sits at the far end, presumably for the librarian. A sign above one set of shelves reads 'Local History'.",
    "[T101.2] Alex pauses, considering the situation.",
    "[T102.5] The Main Library is a grand, high-ceilinged room filled with towering bookshelves. Sunlight streams in through large arched windows, illuminating dust motes dancing in the air. The scent of old paper and leather permeates the space. Several tables and chairs are scattered throughout, and a large oak desk sits at the far end, presumably for the librarian. A sign above one set of shelves reads 'Local History'.",
    "[T107.1] Alex waits, observing the quiet room.",
    "[T111.4] The Main Library is a grand, high-ceilinged room filled with towering bookshelves. Sunlight streams in through large arched windows, illuminating dust motes dancing in the air. The scent of old paper and leather permeates the space. Several tables and chairs are scattered throughout, and a large oak desk sits at the far end, presumably for the librarian. A sign above one set of shelves reads 'Local History'.",
    "[T114.2] Alex examines the 'Local History' sign and scans the surrounding shelves. After a few moments, he spots a section labeled 'Local Houses and Estates.' ",
    "[T122.7] Alex scans the 'Local Houses and Estates' section, his fingers trailing along the spines of the books. After a moment, his fingers stop on a slightly worn volume. The title reads: 'A History of Hill House'.",
    "[T129.5] Alex pauses, considering the situation.",
    "[T134.1] Eleanor Hayes tries to talk to sim_garrett_2945, but they don't exist.",
    "[T137.3] The entry hall is sparsely decorated. A reception desk sits against one wall, unattended. Double doors lead north, presumably to the inner offices. To the east, a corridor stretches into shadow. A flickering fluorescent light overhead casts a sterile glow.",
    "[T142.6] Alex waits, observing the quiet room.",
    "[T142.7] Sim_662862 steps through the open double doors into the inner offices.",
    "[T147.4] The inner offices are a maze of cubicles, each one seemingly identical. Desks are cluttered with papers and half-empty coffee cups. The air is thick with the hum of computers. A water cooler gurgles in the corner. The faint scent of stale pizza lingers.",
    "[T150.4] Alex waits, observing the quiet room.",
    "[T152.6] Most cubicles seem deserted, but Alex spots a figure hunched over a computer in a far corner, and hears muffled conversation coming from an office near the back.",
    "[T155.2] Eleanor Vance's action failed: Sim_662862 tries to use office but it's not here.",
    "[T157.7] Alex waits, observing the quiet room.",
    "[T162.0] Further observation reveals a small sign on the door: 'Office 3B - Dr. Eleanor Vance - Research Lab'.",
    "[T162.8] After a closer look, Sim_662862 identifies the source of the muffled conversation as 'Cubicle_4A', a small, semi-enclosed space with papers stacked haphazardly around the monitor.",
    "[T165.1] Eleanor Hayes's action failed: Alex tries to use Cubicle_4A but it's not here.",
    "[T167.0] Sim_662862 approaches Cubicle_4A.",
    "[T171.1] Alex heads to Office 3B.",
    "[T172.6] Cubicle_4A is occupied by a woman in a lab coat, intently studying a series of complex diagrams. She seems oblivious to Sim_662862's arrival.",
    "[T174.3] Eleanor Vance tries to talk to sim_woman_labcoat, but they don't exist.",
    "[T176.2] Office 3B is cluttered but functional. Bookshelves line one wall, filled with scientific journals and textbooks. A large whiteboard is covered in equations and diagrams. A faint chemical odor hangs in the air. There is nobody else in the office.",
    "[T178.3] Eleanor Hayes tries to talk to sim_eleanor_vance, but they don't exist.",
    "[T180.3] A closer inspection reveals a framed photograph on the desk: a younger Dr. Vance stands beside a man in a tweed jacket, smiling broadly. The photo is inscribed: 'To Eleanor, with love, David'.",
    "[T186.8] Alex waits, observing the quiet room.",
    "[T195.2] The room is small and sparsely furnished. A metal desk sits against one wall, its surface clean except for a small lamp. A simple cot is in the corner, covered with a thin, grey blanket. The walls are bare metal, and a single, heavy door is the only visible exit. The air is stale and slightly damp.",
    "[T202.6] The office is small and sparsely furnished. A metal desk sits against one wall, topped with a dusty computer. A single window, barred from the outside, offers a view of the street. A sturdy door is set into the opposite wall.",
    "[T204.5] Eleanor Vance tries to talk to SimulacraLLM_sim_3e912d, but they don't exist.",
    "[T208.7] Alex turns on the computer. After a short boot sequence, the desktop appears, revealing a familiar operating system. Alex begins searching for information about the building and potential escape routes.",
    "[T210.5] Eleanor Hayes tries to talk to SimulacraLLM_sim_662862, but they don't exist.",
    "[T212.5] Theodora pauses, considering...",
    "[T223.4] Eleanor Vance's action failed: Action failed due to internal error (JSON decode).",
    "[T225.3] The room is small and circular, with smooth, metallic walls. There is a single, heavy door to the north. In the center of the room sits a tall, ornate bookshelf. A faint humming sound permeates the air.",
    "[T230.3] Alex moves towards the bookshelf in the center of the room.",
    "[T232.1] Alex moves towards the bookshelf.",
    "[T235.4] Alex examines the bookshelf closely, noting the aged spines of countless volumes and the intricate carvings adorning its frame.",
    "[T237.2] Alex studies the bookshelf carefully, scrutinizing the titles and the overall arrangement of the books.",
    "[T242.9] Alex runs their fingers along the spines and edges of the books, carefully probing for any sign of a hidden mechanism or loose volume.",
    "[T247.4] The reception area is sterile and unwelcoming. A long, curved desk dominates the room, behind which sits a vacant chair. The walls are a pale, uniform gray, devoid of any decoration save for a single, unlit sign. To the north, a heavy steel door is set into the wall. To the east, a wide archway leads to a darker area. The air is still and silent, adding to the unsettling atmosphere.",
    "[T248.7] Alex moves further down the hallway.",
    "[T252.3] Alex moves towards the archway to the east.",
    "[T253.2] The hallway stretches further into the darkness. The dim light flickers intermittently, casting long, dancing shadows. To the west is the door Alex previously attempted to open, still locked. Further down the hallway, a faint buzzing sound can be heard.",
    "[T256.8] Alex moves towards the steel door to the north.",
    "[T257.6] Alex walks further down the hallway towards the buzzing sound.",
    "[T263.0] The hallway continues, the buzzing growing louder. Dim light flickers overhead, revealing nothing new except a slight metallic tang in the air.",
    "[T268.7] Eleanor Vance's action failed: Action failed due to internal error (JSON decode).",
    "[T270.6] The room is sparsely furnished with a metal desk and a chair. A single window is barred, offering a limited view of the outside. The walls are bare except for some peeling paint. There's a heavy steel door to the north and a ventilation shaft in the ceiling.",
    "[T272.5] Eleanor Hayes's action failed: Action failed due to internal error (JSON decode).",
    "[T279.7] The hallway stretches long and narrow, illuminated by flickering fluorescent lights. The walls are a drab, institutional green, lined with a series of identical doors, each bearing a small, opaque window. A worn, grey carpet runs the length of the corridor. At the far end, a faint buzzing sound can be heard, possibly from an electrical fixture. To the east, there's an opening leading to what appears to be a reception area.",
    "[T281.0] The grand foyer is a cavernous space, easily fifty feet high. Light streams in from massive arched windows, illuminating swirling dust motes. A sweeping staircase dominates the west wall, its mahogany banister polished to a mirror sheen. To the east, a pair of ornately carved double doors suggest a ballroom or dining hall beyond. Directly ahead, a long hallway stretches into the depths of the mansion. A large, antique rug covers the marble floor, its intricate patterns faded with age.",
    "[T286.5] Alex moves towards the hallway, ready to venture deeper into the mansion.",
    "[T287.4] Alex moves through the opening into the brightly lit reception area.",
    "[T291.3] Alex steps into the hallway, the air growing noticeably cooler.",
    "[T292.1] The reception area is small but tidy. A worn, velvet rope separates the public area from a dark wood desk. Behind the desk, a corkboard is plastered with notices and memos. A single, potted fern sits on the corner of the desk, its fronds slightly yellowed. The hallway entrance is to the west. To the north, a door labeled 'Private' is firmly shut.",
    "[T296.1] Alex continues further down the hallway, the cool air intensifying with each step.",
    "[T300.1] Alex tries the handle of the 'Private' door, but it's locked.",
    "[T301.2] Alex continues down the hallway, the temperature dropping noticeably.",
    "[T309.1] Alex tries the door handle, but the door remains firmly shut.",
    "[T309.4] Alex tries the door handle, finding it unlocked. The door swings open.",
    "[T312.5] The office is small and sparsely furnished. A desk sits against one wall, cluttered with papers and a computer. A locked door, labeled 'Exit', is on the opposite wall. A window looks out onto a busy street. The walls are painted a drab gray.",
    "[T314.8] Alex moves through the open door into the Hallway.",
    "[T315.8] Alex tries to open the window, but it's sealed shut.",
    "[T318.2] The hallway stretches dimly in both directions, lined with closed office doors. Fluorescent lights flicker overhead. A sign on the wall reads 'Emergency Exit ->'. At the end of the hall, a stairwell door is visible.",
    "[T321.2] Alex tries to break the window, but it's made of thick, reinforced glass that doesn't even crack.",
    "[T332.0] Alex moves towards the living room.",
    "[T332.2] The small bathroom has a basic sink and toilet. A mirror hangs above the sink. The door, the only apparent exit, is locked.",
    "[T335.3] The living room is sparsely furnished, with a worn sofa and a dusty coffee table. A fireplace dominates one wall, and a large window looks out onto a overgrown garden. There's a door leading further into the house.",
    "[T339.9] Alex smashes the mirror, creating several jagged shards of glass.",
    "[T340.7] Alex struggles with the window, but it's stuck fast and painted shut.",
    "[T346.4] The bedroom is sparsely furnished. A narrow bed sits against one wall, covered with a faded quilt. A wooden dresser stands opposite the bed, its drawers slightly ajar. The window, sealed shut, is the only source of light. The door is to your left.",
    "[T346.6] [SimulacraLLM_sim_662862] tries to search drawers the dresser_bedroom, but nothing happens / that doesn't seem possible.",
    "[T347.1] [SimulacraLLM_sim_662862] tries to open drawers the dresser_bedroom, but nothing happens / that doesn't seem possible.",
    "[T348.4] [SimulacraLLM_sim_3e912d] waits, observing...",
    "[T348.5] 'world_action' should not have a target_id.",
    "[T350.4] The bedroom is sparsely furnished. A narrow bed sits against one wall, covered with a faded quilt. A wooden dresser stands opposite the bed, its drawers slightly ajar. The window, sealed shut, is the only source of light. The door is to your left.",
    "[T350.6] [SimulacraLLM_sim_662862] tries to open the door the door_bedroom, but nothing happens / that doesn't seem possible.",
    "[T350.8] [SimulacraLLM_sim_3e912d] tries to move exit through the door, but the path is blocked by [obstacle/closed exit].",
    "[T350.8] [SimulacraLLM_sim_662862] tries to try handle the door_bedroom, but nothing happens / that doesn't seem possible.",
    "[T353.9] The bedroom is sparsely furnished. A narrow bed sits against one wall, covered with a faded quilt. A wooden dresser stands opposite the bed, its drawers slightly ajar. The window, sealed shut, is the only source of light. The door is to your left.",
    "[T354.1] [SimulacraLLM_sim_3e912d] tries to look under the bed the bed_bedroom, but nothing happens / that doesn't seem possible.",
    "[T355.4] Eleanor Vance's action failed: Action failed due to internal error (JSON decode).",
    "[T358.3] The room is small and sparsely furnished. A single, bare mattress lies on the floor. The walls are a dull grey, and there's a small, barred window high up. A heavy steel door is the only visible exit.",
    "[T361.5] The room is sparsely furnished, containing only a metal bed bolted to the floor, a washbasin in the corner, and a small, barred window high up on one wall. The walls are bare concrete, and a heavy steel door is the only visible exit.",
    "[T361.6] The back office is cramped and dimly lit. A cluttered desk sits against one wall, covered in papers and old computer parts. A flickering fluorescent light overhead casts long shadows. A metal door is the only apparent exit.",
    "[T361.7] Eleanor Vance tries the handle of the heavy steel door, but it doesn't budge. The door seems to be locked.",
    "[T361.8] Eleanor Hayes searches the desk for clues, sifting through the papers and computer parts.",
    "[T362.1] Eleanor Hayes's action failed: Action failed due to internal error (JSON decode)."
  ],
  "simulacra": {
    "sim_662862": {
      "id": "sim_662862",
      "name": "Eleanor Vance",
      "persona": {
        "Name": "Eleanor Vance",
        "Age": 33,
        "Occupation": "Brewery Tour Guide",
        "Current_location": "Asheville, NC",
        "Personality_Traits": [
          "Outgoing",
          "Friendly",
          "Knowledgeable",
          "Patient",
          "Enthusiastic"
        ],
        "Birthplace": "Charlotte, NC",
        "Birthdate": "1991-07-15",
        "Birthtime": "08:30",
        "Education": "Bachelor of Arts in History, UNC Asheville",
        "Physical_Appearance": "Average height, with curly auburn hair, green eyes, and a smattering of freckles. Often seen wearing comfortable, casual clothing suitable for walking tours.",
        "Hobbies": "Hiking, reading historical fiction, exploring local breweries, volunteering at the animal shelter.",
        "Skills": "Public speaking, historical knowledge, beer tasting, first aid, excellent customer service.",
        "Languages": "English",
        "Health_Status": "Generally healthy, occasional seasonal allergies.",
        "Family_Background": "Grew up in a middle-class family in Charlotte. Her parents are retired teachers. She has one younger brother who lives in Raleigh.",
        "Life_Goals": "To become a certified Cicerone, travel to Europe to explore beer cultures, and eventually start her own brewery or pub.",
        "Notable_Achievements": "Graduated cum laude from UNC Asheville, won 'Employee of the Month' at the brewery twice.",
        "Fears": "Public speaking failures, disappointing her parents, not achieving her career goals.",
        "Strengths": "Enthusiasm, strong communication skills, historical knowledge, adaptability.",
        "Weaknesses": "Can be overly critical of herself, tends to overcommit, struggles with saying no.",
        "Ethnicity": "Caucasian",
        "Religion": null,
        "Political_Views": "Left-leaning, advocates for environmental protection and social justice.",
        "Favorite_Foods": "Craft burgers, gourmet cheese plates, anything with avocados.",
        "Favorite_Music": "Indie folk, Americana, bluegrass.",
        "Favorite_Books": "Historical fiction, biographies, books about beer and brewing.",
        "Favorite_Movies": "Documentaries, comedies, classic films.",
        "Pet_Peeves": "People being rude to service staff, littering, close-mindedness.",
        "Dreams": "To own a successful brewery that is known for its innovative beers and sustainable practices.",
        "Past_Traumas": null
      },
      "location": "At home",
      "home_location": "At home",
      "status": "idle",
      "current_action_end_time": 363.2766499998908,
      "goal": "Determine your own long term goals.",
      "last_observation": "You slowly wake up in your familiar bed. Sunlight streams through the window, and you can hear birds chirping outside.",
      "memory_log": []
    },
    "sim_3e912d": {
      "id": "sim_3e912d",
      "name": "Eleanor Hayes",
      "persona": {
        "Name": "Eleanor Hayes",
        "Age": 29,
        "Occupation": "Brewery Tour Guide",
        "Current_location": "Asheville, NC",
        "Personality_Traits": [
          "Enthusiastic",
          "Outgoing",
          "Knowledgeable",
          "Patient",
          "Adaptable"
        ],
        "Birthplace": "Charlotte, NC",
        "Birthdate": "1995-07-15",
        "Birthtime": "14:30",
        "Education": "Bachelor of Arts in History",
        "Physical_Appearance": "5'6\", with wavy auburn hair and green eyes. Usually seen wearing comfortable clothing and sturdy walking shoes.",
        "Hobbies": "Hiking, trying new craft beers, reading local history, volunteering at the animal shelter",
        "Skills": "Public speaking, historical knowledge, beer knowledge, customer service, navigating Asheville",
        "Languages": "English",
        "Health_Status": "Generally healthy, occasional allergies",
        "Family_Background": "Middle-class family, parents still living in Charlotte, one younger brother.",
        "Life_Goals": "To become a local history expert and potentially open a small historical tour business.",
        "Notable_Achievements": "Graduated cum laude from UNC Chapel Hill, received excellent customer service awards at previous jobs.",
        "Fears": "Heights, public speaking failures, not being able to achieve her goals",
        "Strengths": "Strong communication skills, historical knowledge, adaptability",
        "Weaknesses": "Can be overly critical of herself, sometimes struggles to say no.",
        "Ethnicity": "Caucasian",
        "Religion": null,
        "Political_Views": "Liberal",
        "Favorite_Foods": "Anything from local Asheville restaurants, especially farm-to-table cuisine.",
        "Favorite_Music": "Indie rock, bluegrass, local Asheville bands",
        "Favorite_Books": "Local history books, historical fiction",
        "Favorite_Movies": "Documentaries, comedies",
        "Pet_Peeves": "Rude tourists, littering, traffic congestion",
        "Dreams": "To share her love of history with others and create a successful business.",
        "Past_Traumas": null
      },
      "location": "At home",
      "home_location": "At home",
      "status": "idle",
      "current_action_end_time": 363.2766499998908,
      "goal": "Determine your own long term goals.",
      "last_observation": "You slowly wake up in your familiar bed. Sunlight streams through the window, and you can hear birds chirping outside.",
      "memory_log": []
    },
    "alex": {
      "location": "reception_area"
    }
  },
  "current_world_state": {
    "location_details": {}
  },
  "simulacra_profiles": {
    "sim_662862": {
      "persona_details": {
        "Name": "Eleanor Vance",
        "Age": 33,
        "Occupation": "Brewery Tour Guide",
        "Current_location": "Asheville, NC",
        "Personality_Traits": [
          "Outgoing",
          "Friendly",
          "Knowledgeable",
          "Patient",
          "Enthusiastic"
        ],
        "Birthplace": "Charlotte, NC",
        "Birthdate": "1991-07-15",
        "Birthtime": "08:30",
        "Education": "Bachelor of Arts in History, UNC Asheville",
        "Physical_Appearance": "Average height, with curly auburn hair, green eyes, and a smattering of freckles. Often seen wearing comfortable, casual clothing suitable for walking tours.",
        "Hobbies": "Hiking, reading historical fiction, exploring local breweries, volunteering at the animal shelter.",
        "Skills": "Public speaking, historical knowledge, beer tasting, first aid, excellent customer service.",
        "Languages": "English",
        "Health_Status": "Generally healthy, occasional seasonal allergies.",
        "Family_Background": "Grew up in a middle-class family in Charlotte. Her parents are retired teachers. She has one younger brother who lives in Raleigh.",
        "Life_Goals": "To become a certified Cicerone, travel to Europe to explore beer cultures, and eventually start her own brewery or pub.",
        "Notable_Achievements": "Graduated cum laude from UNC Asheville, won 'Employee of the Month' at the brewery twice.",
        "Fears": "Public speaking failures, disappointing her parents, not achieving her career goals.",
        "Strengths": "Enthusiasm, strong communication skills, historical knowledge, adaptability.",
        "Weaknesses": "Can be overly critical of herself, tends to overcommit, struggles with saying no.",
        "Ethnicity": "Caucasian",
        "Religion": null,
        "Political_Views": "Left-leaning, advocates for environmental protection and social justice.",
        "Favorite_Foods": "Craft burgers, gourmet cheese plates, anything with avocados.",
        "Favorite_Music": "Indie folk, Americana, bluegrass.",
        "Favorite_Books": "Historical fiction, biographies, books about beer and brewing.",
        "Favorite_Movies": "Documentaries, comedies, classic films.",
        "Pet_Peeves": "People being rude to service staff, littering, close-mindedness.",
        "Dreams": "To own a successful brewery that is known for its innovative beers and sustainable practices.",
        "Past_Traumas": null
      },
      "current_location": "At home",
      "home_location": "At home"
    },
    "sim_3e912d": {
      "persona_details": {
        "Name": "Eleanor Hayes",
        "Age": 29,
        "Occupation": "Brewery Tour Guide",
        "Current_location": "Asheville, NC",
        "Personality_Traits": [
          "Enthusiastic",
          "Outgoing",
          "Knowledgeable",
          "Patient",
          "Adaptable"
        ],
        "Birthplace": "Charlotte, NC",
        "Birthdate": "1995-07-15",
        "Birthtime": "14:30",
        "Education": "Bachelor of Arts in History",
        "Physical_Appearance": "5'6\", with wavy auburn hair and green eyes. Usually seen wearing comfortable clothing and sturdy walking shoes.",
        "Hobbies": "Hiking, trying new craft beers, reading local history, volunteering at the animal shelter",
        "Skills": "Public speaking, historical knowledge, beer knowledge, customer service, navigating Asheville",
        "Languages": "English",
        "Health_Status": "Generally healthy, occasional allergies",
        "Family_Background": "Middle-class family, parents still living in Charlotte, one younger brother.",
        "Life_Goals": "To become a local history expert and potentially open a small historical tour business.",
        "Notable_Achievements": "Graduated cum laude from UNC Chapel Hill, received excellent customer service awards at previous jobs.",
        "Fears": "Heights, public speaking failures, not being able to achieve her goals",
        "Strengths": "Strong communication skills, historical knowledge, adaptability",
        "Weaknesses": "Can be overly critical of herself, sometimes struggles to say no.",
        "Ethnicity": "Caucasian",
        "Religion": null,
        "Political_Views": "Liberal",
        "Favorite_Foods": "Anything from local Asheville restaurants, especially farm-to-table cuisine.",
        "Favorite_Music": "Indie rock, bluegrass, local Asheville bands",
        "Favorite_Books": "Local history books, historical fiction",
        "Favorite_Movies": "Documentaries, comedies",
        "Pet_Peeves": "Rude tourists, littering, traffic congestion",
        "Dreams": "To share her love of history with others and create a successful business.",
        "Past_Traumas": null
      },
      "current_location": "At home",
      "home_location": "At home"
    }
  },
  "world_template_details": {
    "description": "Default",
    "rules": {}
  }
}